


Map decoder = {
  '0x180A': 'информация об устройстве',
  '0x180F': 'заряд батареи',
  '0x2A29': 'производитель устройства',
  '0x2A24': 'модель устройства',
  '0x2A25': 'серийный номер устройства',
  '0x2A27': 'версия аппаратного обеспечения',
  '0x2A26': 'версия прошивки',
  '0x2A28': 'версия ПО',
  '0x2A23': 'уникальный идентификатор устройства',
  '0x2A2A': 'данные о сертификации устройства',
  '0x2A50': 'информация о производителе устройства, его ID, а также версии продукта',
  '0x2A19': 'текущий уровень заряда батареи',
};